Repository: amaton/castillo
Catalog: hamon/sites/default/files/translations/commerce_autosku-7.x-1.1.*.po
Languages: ru

source: Advanced
ru: Расширенные

source: Uppercase
ru: Верхний регистр

source: Lowercase
ru: Нижний регистр

source: Do not change
ru: Не изменять

source: Automatically Generate SKU
ru: Автоматическая генерация SKU

source: AutoSKU Parameters
ru: Параметры авто-SKU

source: SKU Pattern
ru: Шаблон артикула

source: Always regenerate SKU
ru: Всегда пересоздавать SKU

source: Hide SKU Field
ru: Спрятать поле SKU

source: SKU Case
ru: Регистр SKU
