Repository: amaton/castillo
Catalog: hamon/sites/default/files/translations/elfinder-7.x-0.x.*.po
Languages: ru

source: Home
ru: Главная

source: User interface
ru: Интерфейс пользователя

source: Save configuration
ru: Сохранить конфигурацию

source: Yes
ru: Да

source: No
ru: Нет

source: Miscellaneous settings
ru: Разные настройки

source: Image settings
ru: Настройки изображений

source: Files
ru: Файлы

source: Not found
ru: Не найдено

source: Thumbnail size
ru: Размер миниатюры

source: browse
ru: обзор

source: Exists
ru: Существует

source: Root directory
ru: Корневой каталог

source: File Browser
ru: Файловый браузер

source: File Manager
ru: Менеджер файлов

source: Changes have been saved.
ru: Изменения сохранены.

source: Select
ru: Выбрать

source: Relative
ru: Относительное

source: File created
ru: Файл создан

source: File system settings
ru: Настройки файловой системы

source: File browser
ru: Файловый браузер

source: Custom URL
ru: Пользовательский URL

source: Absolute
ru: Абсолютный

source: File uploads
ru: Загрузки файлов

source: Custom path
ru: Пользовательский путь

source: No file selected
ru: Ни один файл не выбран

source: elFinder library was not found. Please download it from <a href="@url">@url</a> and install to @libpath.
ru: Библиотека elFinder не найдена.Пожалуйста, загрузите ее с <a href="@url">@url</a> и установите в папку с библиотеками @libpath.

source: Manage media files.
ru: Работа с медиа файлами.

source: Use elFinder file manager
ru: Использовать менеджер файлов elFinder

source: Allow accessing elFinder file manager module
ru: Разрешить доступ к менеджеру файлов elFinder

source: Administer file manager
ru: Управление менеджером файлов

source: Allow users to administer file manager
ru: Доступ к административной странице файлового менеджера

source: Create new directories
ru: Создание новых папок

source: Allow users to create new directories
ru: Разрешить пользователям создавать новые папки

source: Create new files
ru: Создание новых файлов

source: Allow users to create new files
ru: Разрешить пользователям создавать новые файлы

source: Rename files and directories
ru: Переименовывать файлы и папки

source: Allow users to rename files and directories
ru: Разрешить пользователями переименовывать файлы и папки

source: Allow users to upload files
ru: Разрешить пользователям загружать файлы на сервер

source: Paste from clipboard
ru: Вставка из буфера обмена

source: Allow users to paste files from clipboard
ru: Разрешить пользователями вставлять файлы из буфера обмена

source: Delete files and directories
ru: Удаление файлов и папок

source: Allow users to delete files and directories
ru: Разрешить пользователями удалять файлы и папки

source: Duplicate files
ru: Дублирование файлов

source: Allow users to duplicate files
ru: Разрешить пользователям дублировать файлы

source: Edit files
ru: Редактирование файлов

source: Allow users to edit files
ru: Разрешить пользователям редактировать файлы

source: Add files to archive
ru: Добавлять файлы в архив

source: Allow users add files to archive
ru: Разрешить пользователям добавлять файлы в архивы

source: Extract files from archive
ru: Распаковка файлов из архивов

source: Allow users to extract files from archive
ru: Разрешить пользователям распаковывать файлы из архива

source: Resize images
ru: Изменять размер изображений

source: Allow users to resize images
ru: Разрешить пользователям изменять размеры изображений

source: elFinder file manager settings
ru: Управления настройками файлового менеджера elFinder

source: Use system defaults (@systemroot)
ru: Использовать системные настройки (@systemroot)

source: Specify custom path
ru: Задать пользовательский путь

source: Custom filesystem root path.
ru: Путь к пользовательскому корневому каталогу.

source: Custom filesystem url.
ru: Ссылка (URL) к пользовательскому каталогу.

source: File type detection
ru: Способ определения типа файла

source: Automatical detection
ru: Автоматическое определение

source: By file extension (built-in)
ru: По расширению файла (встроенный)

source: Selected file url type
ru: Тип ссылки на файл

source: Thumbnail directory name
ru: Название папки для миниатюр

source: Created file permissions
ru: Права на создаваемые файлы

source: Created directory permissions
ru: Права на создаваемые папки

source: Image manipulation library
ru: Библиотека обработки изображений

source: Remember last opened directory
ru: Запоминать последнюю открытую папку

source: Creates a cookie. Disable if you have issues with caching.
ru: Использует Cookie. Отключите, если получаете проблемы с кэшированием.

source: Filesystem root is not writable
ru: Корневая папка недоступна на запись

source: Created file permissions should be a numeric
ru: Права на создаваемые файлы должны быть числом вида 0666

source: Created directory permissions should be a numeric
ru: Права на создаваемые папки должны быть числом вида 0777

source: elFinder File browser
ru: Менеджер файлов elFinder

source: Available tokens: <code>%files</code> (base path, eg: <code>/</code>), <code>%name</code> (current username, eg: <code>@u</code>), <code>%uid</code> (current user id, eg: <code>@uid</code>), <code>%lang</code> (current language code, eg: <code>@lang</code>), plus all tokens provided by token module
ru: Доступные маркеры: <code>%files</code> (базовый путь, пр.: <code>/</code>), <code>%name</code> (логин активного пользователя, пр.: <code>@u</code>), <code>%uid</code> (идентификатор активного пользователя, пр.: <code>@uid</code>), <code>%lang</code> (код текущего языка, пр.: <code>@lang</code>), плюс все маркеры, предоставляемые модулем Token.

source: Use system jQuery
ru: Использовать системный jQuery

source: Use system jQuery and jQuery UI when possible. Disable if you have issues with UI.
ru: Когда возможно, использовать системный jQuery и jQuery UI. Отключите, если у вас проблемы с работой интерфейса.

source: elFinder BUEditor integration
ru: Интеграция elFinder с BUEditor
